tutorials/compressible/nexaFoam/neTCLib/heatBath_case3/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistry           true;

chemistryType
{
    solver          neEulerImplicit;
}

initialChemicalTimeStep 1e-07;

EulerImplicitCoeffs
{
    cTauChem        1;
    equilibriumRateLimiter off;
}

/*odeCoeffs
{
    solver          Rosenbrock34;
    absTol          1e-12;
    relTol          0.01;
}*/


// ************************************************************************* //
